# -*- encoding:utf-8 -*-


SEX_CHOICE = (
    ("M", u"男"),
    ("F", u"女")
)

USER_LEVEL = (
    (0, u"管理员"),
    (1, u"普通用户")
)

STATUS = (
    (0, u"禁用"),
    (1, u"正常"),
)

VOLUNTEER_STATUS = (
    (0, u"审核中"),
    (1, u"正常"),
    (2, u"注销"),
)

EVALUATION_TYPE = (
    (0, u"课程"),
    (1, u"志愿者"),
    (2, u"书籍"),
    (3, u"活动"),
    (9, u"其他")
)

EVALUATION = (
    (0, u"非常同意"),
    (1, u"同意"),
    (2, u"一般"),
    (3, u"不同意"),
    (4, u"非常不同意")
)

COURSE_STATUS = (
    (0, u"未开始"),
    (1, u"未评估"),
    (2, u"已评估"),
)

ACTIVITY_TYPE = (
    (0, u"阅读"),
    (1, u"伴读"),
    (9, u"其他")
)


VOLUNTEER_TYPE = (
    ('01', u"普通志愿者"),
    ('02', u"技术志愿者"),
    ('03', u"导师"),
    ('04', u"专家"),
    ('05', u"宣传志愿者"),
    ('99', u"其他类志愿者"),
)